; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	infrared0 - mode
	infrared1 - mode
	GroundStation5 - direction
	Star4 - direction
	GroundStation0 - direction
	Star2 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
	(supports instrument2 infrared0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star4)
	(supports instrument3 infrared1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star4)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 infrared0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star4)
	(supports instrument6 infrared1)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
	(supports instrument7 infrared0)
	(supports instrument7 infrared1)
	(calibration_target instrument7 Star2)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon6)
	(supports instrument8 infrared0)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star2)
	(calibration_target instrument8 GroundStation1)
	(supports instrument9 infrared0)
	(supports instrument9 infrared1)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 infrared0)
	(calibration_target instrument10 GroundStation3)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star2)
)
(:goal (and
	(pointing satellite3 GroundStation3)
	(have_image Phenomenon6 infrared1)
	(have_image Star7 infrared0)
	(have_image Phenomenon8 infrared1)
	(have_image Planet9 infrared1)
	(have_image Planet10 infrared1)
	(have_image Phenomenon11 infrared1)
))

)

; plan
1. (switch_on instrument8 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument8)
   goals met: 0 of 7
2. (calibrate satellite5 instrument8 star2)
   added: (calibrated instrument8)
   goals met: 0 of 7
3. (turn_to satellite5 phenomenon8 star2)
   deleted: (pointing satellite5 star2)
   added: (pointing satellite5 phenomenon8)
   goals met: 0 of 7
4. (take_image satellite5 phenomenon8 instrument8 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 1 of 7
5. (turn_to satellite5 phenomenon6 phenomenon8)
   deleted: (pointing satellite5 phenomenon8)
   added: (pointing satellite5 phenomenon6)
   goals met: 1 of 7
6. (take_image satellite5 phenomenon6 instrument8 infrared1)
   added: (have_image phenomenon6 infrared1)
   goals met: 2 of 7
7. (turn_to satellite5 phenomenon11 phenomenon6)
   deleted: (pointing satellite5 phenomenon6)
   added: (pointing satellite5 phenomenon11)
   goals met: 2 of 7
8. (turn_to satellite3 groundstation3 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 groundstation3)
   goals met: 3 of 7
9. (take_image satellite5 phenomenon11 instrument8 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 4 of 7
10. (turn_to satellite5 planet10 phenomenon11)
   deleted: (pointing satellite5 phenomenon11)
   added: (pointing satellite5 planet10)
   goals met: 4 of 7
11. (take_image satellite5 planet10 instrument8 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 5 of 7
12. (turn_to satellite5 planet9 planet10)
   deleted: (pointing satellite5 planet10)
   added: (pointing satellite5 planet9)
   goals met: 5 of 7
13. (take_image satellite5 planet9 instrument8 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 6 of 7
14. (turn_to satellite5 star7 planet9)
   deleted: (pointing satellite5 planet9)
   added: (pointing satellite5 star7)
   goals met: 6 of 7
15. (take_image satellite5 star7 instrument8 infrared0)
   added: (have_image star7 infrared0)
   goals met: 7 of 7
